app/views/students/show.html.erb

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = ?  [["student_id", 1]]
---
  <tbody>
    <% @student.enrollments.each do |enrollment| %>