app/views/professors/show.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."professor_id" = ?  [["professor_id", 1]]
---
    <tbody>
      <% @professor.sections.each do |section| %>

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."section_id" = ?  [["section_id", 9]]
---
        </tr>
          <% section.enrollments.each do |enrollment| %>