app/views/courses/show.html.erb

  <strong>Sections:</strong><br>
  <% @course.sections.each do |section| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."course_id" = ?  [["course_id", 1]]