app/controllers/courses_controller.rb

  def index
  #  @professors = Professor.all
   @courses = if params[:search]
     Course.where('name Like ?', "%#{params[:search]}%")
   else
     Course.all
---
SELECT "courses".* FROM "courses" WHERE (name Like '%CS1%')
SELECT "courses".* FROM "courses" ORDER BY "courses"."created_at" DESC

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "CS1"], ["created_at", "2017-09-13 00:44:13.582909"], ["updated_at", "2017-09-13 00:44:13.582909"]]