app/controllers/professors_controller.rb

  def index
  #  @professors = Professor.all
   @professors = if params[:search]
     Professor.where('name Like ?', "%#{params[:search]}%")
   else
     Professor.all
---
SELECT "professors".* FROM "professors" WHERE (name Like '%%')
SELECT "professors".* FROM "professors" ORDER BY "professors"."created_at" ASC

  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save
---
INSERT INTO "professors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Steve Beaty"], ["created_at", "2017-09-13 00:43:43.784795"], ["updated_at", "2017-09-13 00:43:43.784795"]]

  def destroy
    @professor.destroy
---
DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 4]]

    def set_professor
      @professor = Professor.find(params[:id])
---
SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? ORDER BY "professors"."created_at" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]