app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
---
  def index
    @sections = Section.all

INSERT INTO "sections" ("number", "semester", "room", "professor_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["number", "001"], ["semester", "Fall"], ["room", "101"], ["professor_id", 1], ["course_id", 1], ["created_at", "2017-09-13 00:48:46.339692"], ["updated_at", "2017-09-13 00:48:46.339692"]]
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 2]]
---
  def destroy
    @section.destroy

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_section
      @section = Section.find(params[:id])